package by.tms.fruits.service;

//* Задача3
//        * Создать абстрактный класс Фрукт и классы Яблоко, Груша, Абрикос расширяющие его.
//        * Класс Фрукт содержит:
//        * а) переменную вес,
//        * б) метод printManufacturerInfo(){System.out.print("Made in Belarus");} который нельзя изменить в наследнике.
//        * в) абстрактный метод, возвращающий стоимость фрукта, который должен быть переопределен в каждом классе наследнике.
//        * Метод должен учитывать вес фрукта(Т.е в зависимости от веса разная цена)
//        * Создать несколько объектов разных классов.
//        * Подсчитать общую стоимость проданных фруктов.
//        * А также общую стоимость отдельно проданных яблок, груш и абрикос.
//        *
//        * Задача4*(звездочка)
//        * Используя перечисления(enum), реализовать программу по вычислению площади фигуры (метод getSquare).
//        * Создать классы Фигура, Линия, Треугольник, Прямоугольник. Можно пользоваться интерфейсами, при необходимости!
//        * Если у фигуры нельзя вычислить площадь, то метод не должен быть реализован в в этом классе.
//        * Добавить фигуры в массив, пробежать по массиву и вызвать метод getSquare.
//        * Внимание!!! пользоваться instanceof НЕЛЬЗЯ, тут нужно применить перечисления.
//        */
public class Main {

}
